{
  "version": "2.0",
  "docType": "basic",
  "unitName": "UNITED STATES MARINE CORPS",
  "unitAddress": "MARINE CORPS DETACHMENT\nPRESIDIO OF MONTEREY\nMONTEREY, CALIFORNIA 93944",
  "ssic": "1650",
  "officeCode": "S-3",
  "date": "17 Dec 2025",
  "from": "Staff Sergeant Jesse Morgan, USMC",
  "to": "Commanding Officer, Marine Corps Detachment, Presidio of Monterey",
  "subj": "BENEFICIAL SUGGESTION PROGRAM SUBMISSION; NAVAL LETTER GENERATOR WEB APPLICATION",
  "viaList": [
    "Officer in Charge, Detachment Operations"
  ],
  "refList": [
    "MCO 1650.17F (Marine Corps Beneficial Suggestion Program)",
    "SECNAV M-5216.5 (Department of the Navy Correspondence Manual)",
    "MCO 5216.20B (Marine Corps Correspondence Manual)"
  ],
  "enclList": [
    "Section 508 Accessibility Compliance Certification",
    "Source Code Repository (github.com/jeranaias/navalletterformat)"
  ],
  "copyList": [
    "HQMC (MPO)",
    "Personal File"
  ],
  "paragraphs": [
    {
      "type": "para",
      "subject": "Purpose.",
      "text": "Per reference (a), I submit for evaluation a web-based application that automates the formatting of naval correspondence per references (b) and (c).  The application is fully developed, publicly deployed at no cost to the government, and currently in use by Marines across the force.  It requires no funding, no installation, and no user accounts."
    },
    {
      "type": "para",
      "subject": "Application Overview.",
      "text": "The Naval Letter Generator is a browser-based tool available at jeranaias.github.io/navalletterformat that produces SECNAV M-5216.5 compliant correspondence.  Users enter content; the application handles all formatting automatically including margins, fonts, spacing, paragraph structure, and SSIC codes."
    },
    {
      "type": "subpara",
      "subject": "",
      "text": "Capabilities include: searchable SSIC database with 2,240 codes and plain-language descriptions; automatic paragraph numbering and indentation through four hierarchy levels; properly formatted reference and enclosure blocks; export to PDF (print-ready) and DOCX (editable); full mobile device support; and 38 pre-built templates for common correspondence types."
    },
    {
      "type": "subpara",
      "subject": "",
      "text": "Technical architecture is entirely client-side.  All processing occurs in the user's browser with no data transmitted to any server.  The application works offline after initial page load, requires no authentication or installation, and runs in any modern web browser.  It is hosted on GitHub Pages at zero cost and released under MIT open source license."
    },
    {
      "type": "subpara",
      "subject": "",
      "text": "The application has been evaluated against Section 508 of the Rehabilitation Act and WCAG 2.1 Level AA accessibility standards.  All criteria pass.  Full certification is provided as Enclosure (1)."
    },
    {
      "type": "para",
      "subject": "The Problem Addressed.",
      "text": "Naval correspondence formatting is a recurring friction point across the force.  The requirements are precise and deviation results in rejected correspondence.  Junior Marines learn these standards in MOS school, then spend their careers relearning them every time they draft a letter.  There is no standardized tool.  Each command maintains its own templates of varying quality.  Time spent on formatting is time not spent on substance."
    },
    {
      "type": "para",
      "subject": "Savings Methodology.",
      "text": "Based on analysis of correspondence categories that specifically use standard naval letter format per references (b) and (c), the Marine Corps generates approximately 180,000 naval letters annually.  This estimate excludes forms such as FITREPs, Pros/Cons, page 11s, and unit diary entries which do not use naval letter format."
    },
    {
      "type": "subpara",
      "subject": "",
      "text": "Volume was estimated by category: award nominations (40,000-60,000), endorsements (50,000-75,000), requests (30,000-40,000), recommendations (15,000-25,000), reporting letters (25,000-35,000), administrative correspondence (20,000-30,000), and command correspondence (15,000-25,000).  A 30 percent overlap adjustment was applied for correspondence chains that share content."
    },
    {
      "type": "subpara",
      "subject": "",
      "text": "Cross-validation: 180,000 letters divided by 172,300 Marines equals approximately 1.04 letters per Marine per year, which passes reasonableness testing.  Battalion S-1 throughput analysis independently yielded 175,000-195,000 letters annually."
    },
    {
      "type": "para",
      "subject": "Time Savings Analysis.",
      "text": "Comparison of manual formatting versus tool-assisted formatting shows savings of 14-25 minutes per letter.  Manual process requires: document setup (3-5 min), SSIC identification (2-5 min), header formatting (2-3 min), paragraph structure (3-5 min), reference formatting (2-3 min), signature block (1-2 min), and compliance verification (3-5 min).  Tool-assisted process requires only content entry (2-3 min total).  Conservative estimate applied: 15 minutes saved per letter."
    },
    {
      "type": "para",
      "subject": "Cost Model.",
      "text": "Labor cost based on weighted average across typical admin billet distribution: E-3/E-4 at 40 percent ($45/hr), E-5/E-6 at 45 percent ($55/hr), E-7 and above at 10 percent ($70/hr), and GS-7/9 at 5 percent ($50/hr).  Weighted average: $52 per hour fully burdened."
    },
    {
      "type": "para",
      "subject": "Projected Impact.",
      "text": "At 180,000 letters annually with 15 minutes saved per letter, the Marine Corps would recover approximately 45,000 labor hours per year, valued at $2,340,000.  Applying 50 percent reduction for adoption variability and first-year rollout lag yields conservative estimate of $1,170,000 in recovered labor value."
    },
    {
      "type": "para",
      "subject": "Multi-Service Scope.",
      "text": "This tool applies to all naval correspondence governed by reference (b), including Navy active duty, Navy Reserve, and Marine Corps Reserve.  The formatting standards are identical across all Department of the Navy components."
    },
    {
      "type": "subpara",
      "subject": "",
      "text": "Total addressable population across all naval services is approximately 595,000 personnel generating approximately 700,000 naval letters annually.  At full adoption, gross savings across all Department of the Navy components would be approximately $9.1 million annually.  At conservative 50 percent adoption: $4.55 million."
    },
    {
      "type": "subpara",
      "subject": "",
      "text": "No additional development is required to support Navy or Reserve components.  The tool works for all users of reference (b) without modification."
    },
    {
      "type": "para",
      "subject": "Implementation Options.",
      "text": "Four implementation paths are available, ranging from no action to full government hosting."
    },
    {
      "type": "subpara",
      "subject": "",
      "text": "Option A (Status Quo): Marines continue discovering the tool through word of mouth.  Zero effort required.  Benefits accrue gradually."
    },
    {
      "type": "subpara",
      "subject": "",
      "text": "Option B (Awareness Campaign): HQMC or TECOM issues MARADMIN informing the force the resource exists.  Rapid awareness with minimal effort.  Tool remains externally hosted."
    },
    {
      "type": "subpara",
      "subject": "",
      "text": "Option C (Official Reference): Tool is cited in MCO 5216.20B supplement or TECOM training materials as authorized resource.  Provides institutional endorsement and sustained visibility."
    },
    {
      "type": "subpara",
      "subject": "",
      "text": "Option D (Government Hosting): Source code transferred to government repository and rehosted on Marines.mil.  Provides full institutional control and permanent availability.  Recommended option.  This is a static web application requiring no database, no server-side processing, and no ongoing maintenance.  Hosting on Marines.mil would be functionally equivalent to hosting a PDF."
    },
    {
      "type": "para",
      "subject": "Stability and Maintenance.",
      "text": "This application has no moving parts.  There is no database to corrupt, no API to deprecate, no authentication service to expire, no backend server to crash.  The formatting rules are based on reference (b), which last received major revision in 2010.  Once deployed to any web server, this application will function indefinitely without intervention."
    },
    {
      "type": "subpara",
      "subject": "",
      "text": "One caveat: the unit address list may need periodic review as units reorganize.  This is a data update, not software maintenance.  Someone with access to current organizational documents could update the list in an afternoon.  Frequency: perhaps annually."
    },
    {
      "type": "para",
      "subject": "Continuity.",
      "text": "I EAS in approximately one year.  The tool will not disappear.  It is hosted on GitHub Pages which is free and persistent.  The MIT open source license permits anyone to fork, modify, or rehost the code.  If transferred to a .mil domain, continuity becomes the government's to manage.  I am not a dependency.  The code is the product."
    },
    {
      "type": "para",
      "subject": "Intellectual Property.",
      "text": "I built this on personal time with personal resources under MIT open source license, which already permits unlimited government use, modification, and redistribution.  If the Marine Corps or Department of the Navy prefers explicit transfer, I am willing to assign all intellectual property rights to the U.S. Government.  A clean handoff eliminates any future ambiguity."
    },
    {
      "type": "para",
      "subject": "Expanded Offer.",
      "text": "This submission is a working proof of concept.  I am offering to build similar tools for any standardized administrative process the Marine Corps identifies as a friction point.  Candidates include: award narrative builders, counseling statement formatters, FITREP bullet generators, PCS checklist systems, screening package builders, and batch award processors.  Every one of these processes shares characteristics with naval letter formatting: rigid standards, high error rates, rework cycles, and no current automation.  What this costs the government: nothing.  I build these on personal time."
    },
    {
      "type": "para",
      "subject": "Security.",
      "text": "The application runs entirely in the browser.  No data is transmitted anywhere.  There is no server, no database, no analytics, no tracking.  Sensitive content never leaves the user's machine.  It is as secure as a calculator app."
    },
    {
      "type": "para",
      "subject": "Anticipated Questions.",
      "text": "The following addresses questions likely to arise during evaluation."
    },
    {
      "type": "subpara",
      "subject": "",
      "text": "Why not just use the Word template from the schoolhouse?  Those templates help, but they still require manual formatting.  Users must know the rules to apply them correctly.  This tool removes that requirement.  User enters content, tool produces compliant output.  No formatting knowledge needed."
    },
    {
      "type": "subpara",
      "subject": "",
      "text": "What if reference (b) changes?  The correspondence manual last received major revision in 2010.  If it changes, updating the tool is straightforward.  The formatting rules are in one place in the code.  This is a one-time task, not ongoing maintenance."
    },
    {
      "type": "subpara",
      "subject": "",
      "text": "Has this been reviewed for accessibility?  Yes.  Full Section 508 and WCAG 2.1 Level AA compliance certification is provided as Enclosure (1).  All criteria pass including color contrast, keyboard navigation, and screen reader compatibility."
    },
    {
      "type": "para",
      "subject": "Current Status.",
      "text": "Development is complete.  The application is live and publicly accessible with no restrictions.  No security incidents or downtime have been recorded.  No user accounts are required.  Cost to government: zero."
    },
    {
      "type": "para",
      "subject": "Certification.",
      "text": "I certify that this suggestion represents my original work developed on personal time using personal resources with no government equipment or funding.  The tool was not created as part of official duties.  I have received no compensation for this work.  The application is provided without restriction under MIT open source license."
    },
    {
      "type": "para",
      "subject": "Recommendation.",
      "text": "Forward this submission for evaluation under reference (a).  I am available to demonstrate the application or provide additional documentation as required.  The point of contact for this matter is the undersigned."
    }
  ],
  "sigName": "J. MORGAN",
  "byDirection": false
}
